; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation5 - direction
	Star0 - direction
	Star2 - direction
	Star4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star2)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(pointing satellite1 Planet11)
	(pointing satellite2 Phenomenon13)
	(have_image Phenomenon6 spectrograph1)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 thermograph0)
	(have_image Star9 thermograph0)
	(have_image Star10 spectrograph1)
	(have_image Planet11 thermograph0)
	(have_image Planet12 spectrograph1)
	(have_image Phenomenon13 thermograph0)
))

)

; plan
1. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 10
2. (calibrate satellite2 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 10
3. (turn_to satellite2 planet12 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet12)
   goals met: 0 of 10
4. (take_image satellite2 planet12 instrument2 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 1 of 10
5. (turn_to satellite2 planet11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet11)
   goals met: 1 of 10
6. (take_image satellite2 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 10
8. (take_image satellite2 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 3 of 10
9. (turn_to satellite2 phenomenon6 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon6)
   goals met: 3 of 10
10. (take_image satellite2 phenomenon6 instrument2 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 4 of 10
11. (turn_to satellite1 planet11 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet11)
   goals met: 5 of 10
12. (turn_to satellite2 planet7 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet7)
   goals met: 5 of 10
13. (take_image satellite2 planet7 instrument2 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 6 of 10
14. (turn_to satellite2 star10 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star10)
   goals met: 6 of 10
15. (take_image satellite2 star10 instrument2 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 7 of 10
16. (turn_to satellite2 star9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star9)
   goals met: 7 of 10
17. (take_image satellite2 star9 instrument2 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 8 of 10
18. (turn_to satellite2 phenomenon13 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 phenomenon13)
   goals met: 9 of 10
19. (take_image satellite2 phenomenon13 instrument2 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 10 of 10
